org.eclipse.daanse.xmla/org.eclipse.daanse.xmla.ws.jakarta.basic.itest/val.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns="urn:schemas-microsoft-com:xml-analysis">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<Discover>
			<RequestType>theRequestType</RequestType>
			<Restrictions>
				<RestrictionList />
			</Restrictions>
			<Properties>
				<PropertyList>
					<DataSourceInfo>theDataSourceInfo</DataSourceInfo>
					<Catalog>theCatalog</Catalog>
					<Format>theFormat</Format>
					<Content>theContent</Content>
				</PropertyList>
			</Properties>
		</Discover>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns="urn:schemas-microsoft-com:xml-analysis">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<Discover xmlns="">

			<RequestType>theRequestType</RequestType>

			<Restrictions>

				<RestrictionList />

			</Restrictions>

			<Properties>

				<PropertyList>

					<DataSourceInfo>theDataSourceInfo</DataSourceInfo>

					<Catalog>theCatalog</Catalog>

					<Format>theFormat</Format>

					<Content>theContent</Content>

				</PropertyList>

			</Properties>

		</Discover>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>